DataProcessors/ПривязкаБухгалтеровРасчетчиковКТорговымТочкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ПривязкаБухгалтеровРасчетчиковКТорговымТочкам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/БухгалтераРасчетчикиВТорговыхТочках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>БухгалтераРасчетчикиВТорговыхТочках</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПривязкаБухгалтеровРасчетчиковКТорговымТочкам/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьБухгалтераРасчетчика(Команда)
	
	Если Не ПроверитьЗаполнение()Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура("Период, ГоловноеПодразделение, ТипПомощника", Объект.Период, Объект.СтруктурнаяЕдиница, "БухгалтерРасчетчик");
	
	ОткрытьФорму("Обработка.ГрафикРаботыПродавцов_ТЗ.Форма.ФормаУстановкаПомощниковПродавцов", ПараметрыОткрытия, ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетЛистыУчетаРасчетчиков(Команда)
	
	ОткрытьФорму("Отчет.ОтчетЛистыУчетаБухгалтеровРасчетчиков.Форма.ФормаОтчета",, ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура БухгалтераРасчетчики(Команда)
	
	ПараметрыОткрытия = Новый Структура("ГоловноеПодразделение", Объект.СтруктурнаяЕдиница);
	ОткрытьФорму("РегистрСведений.БухгалтераРасчетчикиВТорговыхТочках.Форма.ФормаСпискаУправляемая", ПараметрыОткрытия, ЭтаФорма);		
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурнаяЕдиницаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//открыть форму выбора структурных единиц
	ПараметрыОтбора = Новый Структура("НаименованиеГруппы", "Управление розницей.");
	Результат = ОткрытьФормуМодально("Обработка.ГрафикРаботыПродавцов_ТЗ.Форма.ФормаВыбораСтруктурнойЕдиницы", ПараметрыОтбора);
	
	Если Результат <> Неопределено Тогда
		
		Объект.СтруктурнаяЕдиница = Результат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.УстановитьБухгалтераРасчетчика.Доступность = УправлениеДопПравамиПользователей.ПолучитьПравоПользователяУпр(ПланыВидовХарактеристик.ПраваПользователей.РедактированиеПривязокТорговыхТочекКБухгалтерамРасчетчикам, Ложь);
	
КонецПроцедуры
